// Punction is important! Don't remove quotes, colons, commas or square brackets 
// (or otherwise change the structure). Back slashes in directory paths must be 
// quoted like this: "C:\\System\\Apps\\Ghostscript\\gswin64c.exe"
{
  // CbzMage pdf conversion requires Ghostscript version 10 or later (if you use an 
  // earlier version pdf conversion will likely fail). If you don't specify the path 
  // to the Ghostscript excutable, CbzMage will try to find a valid Ghostsscript 
  // installation on Windows. On Linux/macOS it will simply try to use "gs".
  "GhostscriptPath": "",

  // Normally each cbz file will be created alongside the original pdf. If you specify 
  // a CbzDir directory they will created in that directory instead.
  "CbzDir": "",

  // SaveCover true or false. Save a copy of the coverimage alongside the cbz file 
  // when converting a pdf. The default value is false, don't save the cover.
  "SaveCover": false,

  // If you would like to save the coverimages in their own directory instead of
  // alongside the cbz file you can specify the directory here.
  "SaveCoverDir": "",

  // SaveCoverOnly true or false. Use this if you just want to save coverimages, 
  // no cbz files. Note: SaveCover must also be true for SaveCoverOnly to work. 
  "SaveCoverOnly": false,

  // Number of Ghostscript reader threads. Set this to 0 to have CbzMage try to
  // figure out a good value. If memory usage is too high try setting this to a 
  // lower value than the calculated.
  "GhostscriptReaderThreads": 0,

  // This determines the quality of jpg images in the cbz file. You want this as high
  // as possible (90+). The default quality quality 93 (95 create images that are 15% 
  // larger. 98 create images that are 50% larger).
  // images are 
  "JpgQuality": 93,

  // MinimumDpi determines the minimum quality of the pages Ghostscript reads from the 
  // pdf. It's not recommended to set this lower than 300, and setting it higher can
  // cause the cbz files to grow very large. In other words, you probably shouldn't 
  // touch this. Note: to get the best possible result CbzMage will perform a dpi 
  // calculation to find out if it needs to read pages using a higher dpi value.
  "MinimumDpi": 300,

  // Sometimes reading pages using the MinimumDpi setting will create images that are 
  // much larger then the source pdf. CbzMage will detect this and scale the images 
  // down to prevent the cbz file from growing too large - but it will not create 
  // images smaller than the MinimumHeight setting. The default is 1920 (HD).
  "MinimumHeight": 1920,

  // MaximumHeight is a hard cap at imagezize, again to prevent cbz files from 
  // growing impossibly large. The default is 3840 (Ultra HD).
  "MaximumHeight": 3840,

  // Compression level for the cbz file. Valid options are "Fastest", "Optimal" or
  // "NoCompression". The default is "Fastest" because jpg files in the cbz file are 
  // already compressed so "Optimal" gives very little difference in archive size.
  "CompressionLevel": "Fastest"
}
