// Punction is important! Don't remove quotes, colons, commas or curly braces 
// (or otherwise change the structure).
{
  // Pdf conversion can work in two modes: "Faster" and "Slower" (there is no
  // difference in quality between the two modes). Faster uses more memory 
  // - sometimes a lot more - as pdf pages are read to memory and directly into 
  // the cbzfile. Slower uses as little memory as possible as pages are saved to 
  // hard disk before adding them to the cbzfile. 
  "PdfConverterMode": "Faster",

  // Number of Ghostscript reader threads. Set this to 0 to have CbazMage try to
  // figure out a good value. If memory usage is too high you can either set this 
  // to a lower value or try the "Slower" mode mentioned above.
  "NumberOfThreads": 0,

  // The default buffersize is 20000000 (20 MB) which holds all but the largest pdf
  // pages. You can set this lower if you like, the buffers will be expanded as 
  // needed. Note that this setting is mostly ignored when using "Slower" mode.
  "BufferSize": 20000000,

  // This determines the quality of jpg images in the cbzfile. You want this as high
  // as possible (90+). The default is 95 because a higher value causes CbzMage to 
  // create much larger cbzfiles.
  "JpgQuality": 95,


  // MinimumDpi determines the minimum quality of the pages Ghostscript reads from the 
  // pdf. It's not recommended to set this lower than 300, and setting it higher can
  // cause the cbzfiles to grow very large. In other words, don't touch this.
  "MinimumDpi": 300,

  // Sometimes the MinimumDpi setting will create pages that are much larger then the
  // source pdf. CbzMage will detect this and scale the images to prevent the cbzfile 
  // AzwDir is the only required setting. It must point to where your Azw files 
  // are stored - aka the Kdl data directory. If you have a large collection it's 
  // recommended to move this directory to a hard disk with plenty of space. 
  // This is done here: Kdl -> Tools -> Options -> Content -> Change Folder
  "MinimumHeight": 1920,

  // TitlesDir is where the CbzMage title files are stored. Titles currently
  // in Kdl, titles converted to cbz, and the archive database all live here.
  // This can be placed anywhere you want (and takes up very little space).
  // If you specify nothing it will default to "Titles" in the parent directory 
  // of AzwDir.
  "MaximumHeight": 3840,




  // Set the required minimum Ghostscript version. It's really not recommended to 
  // change this as some versions of Ghostscript below 10 didn't work properly when
  // running them in parallel.
  "GhostscriptMinVersion": 10,

  // Compression level for the cbz file. Valid options are "Fastest", "Optimal" or
  // "NoCompression". The default is "Fastest" because jpg files in the cbz file are 
  // already compressed so "Optimal" gives very little difference in archive size.
  "CompressionLevel": "Fastest"
}
