// Punction is important! Don't remove quotes, colons, commas or curly braces 
// (or otherwise change the structure). Back slashes in directory paths must be 
// quoted like this: "C:\\System\\Apps\\CbzMage\\Titles"
{
  // AzwDir is the only required setting. It must point to where your Azw files 
  // are stored - aka the Kdl data directory. If you have a large collection it's 
  // recommended to move this directory to a hard disk with plenty of space. 
  // This is done here: Kdl -> Tools -> Options -> Content -> Change Folder
  "AzwDir": "",

  // TitlesDir is where the CbzMage title files are stored. Titles currently
  // in Kdl, titles converted to cbz, and the archive database all live here.
  // This can be placed anywhere you want (and takes up very little space).
  // If you specify nothing it will default to "Titles" in the parent directory 
  // of AzwDir.
  "TitlesDir": "",

  // CbzDir are where your cbz backups are created. This can be placed anywhere
  // you want. If you specify nothing it will default to "Cbz Backups" in the 
  // parent directory of AzwDir.
  "CbzDir": "",

  // SaveCover true or false. Save a copy of the coverimage alongside the cbz file 
  // when converting a title. The default value is false, don't save the cover.
  "SaveCover": false,

  // If you would like to save the coverimages in their own directory instead of
  // alongside the cbz file you can specify the directory here.
  "SaveCoverDir": "",

  // SaveCoverOnly true or false. Use this if you just want to save coverimages, 
  // no cbz files. To generate a cover gallery of all the books in Kdl simply delete
  // all files in the Converted Titles directory (they will be regenerated).
  // Note: SaveCover must also be true for SaveCoverOnly to work. 
  "SaveCoverOnly": false,

  // The converted titles directory is a subdirectory of TitlesDir. The default
  // name is "Converted Titles", you can change it to something else below. Don't
  // forget to rename the actual directory if you do.
  "ConvertedTitlesDirName": "",

  // Change the name of the ".NEW" and ".UPDATED" markers here if you like. It's 
  // a good idea to keep "." in front of the name to keep the new and updated 
  // titles sorted in front of the other titles.
  "NewTitleMarker": "",
  "UpdatedTitleMarker": "",

  // Speed up scanning and converting by doing it in parallel. Testing has shown
  // 3 is a good value when CbzDir is placed on a standard hard disk drive (HDD). 
  // If the CbzDir is placed on a solid state drive (SSD) increasing this number 
  // may increase the performance for larger collections.
  "NumberOfThreads": 3,

  // Compression level for the cbz file. Valid options are "Fastest", "Optimal" or
  // "NoCompression". The default is "Fastest" because jpg files in the cbz file are 
  // already compressed so "Optimal" gives very little difference in archive size.
  "CompressionLevel": "Fastest",

  // The names of publishers in this list will be normalized. For example if a 
  // publisher name starts with "Marvel" (like "Marvel", "Marvel Comics" or "Marvel 
  // Entertainment Inc.") it will be normalized to just "Marvel".
  "TrimPublishers": [
    "Aftershock",
    "Archaia",
    "Avatar",
    "Avery Hill",
    "Berger",
    "Boom",
    "Cinebook",
    "Creator Owned",
    "Dark Horse",
    "DC",
    "Dead Canary",
    "Dover",
    "Drawn & Quarterly",
    "Dynamite",
    "Europe",
    "Fanbase",
    "Fantagraphics",
    "Humanoids",
    "IDW",
    "Image",
    "Kodansha",
    "Legendary",
    "Magnetic",
    "Markosia",
    "Marvel",
    "MAX",
    "NBM",
    "Soaring Penguin",
    "Source Point",
    "Strawberry",
    "Top Shelf",
    "Vault",
    "Vertical",
    "Viz",
    "Wildstorm",
    "Yen",
    "Z2"
  ]
}
